Revit 2026 API

# RebarContainerItemCanUseHookType Method

---

Checks if the specified RebarHookType id is of a valid RebarHookType for the Rebar's RebarBarType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanUseHookType(
	ElementId proposedHookId
)
```
```vb
Public Function CanUseHookType (
	proposedHookId As ElementId
) As Boolean
```
```cpp
public:
bool CanUseHookType(
	ElementId^ proposedHookId
)
```
```fsharp
member CanUseHookType :
        proposedHookId : ElementId -> bool
```

#### Parameters

proposedHookId ElementId
     The Id of the RebarHookType

#### Return Value

Boolean Returns true if the id is of a valid RebarHookType for the Rebar element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Also, checks that the Style of the Hook matches that of the Rebar's RebarShape

#### Reference

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace